[options]
mode prove
depth	11

[engines]
smtbmc yices

[script]
read_verilog -formal -DLASTSTAGE convround.v
read_verilog -formal -DLASTSTAGE laststage.v
chparam -set IWIDTH 3 -set OWIDTH 4 laststage
prep -top laststage

[files]
../../rtl/laststage.v
../../rtl/convround.v
