[options]
mode prove
depth	20

[engines]
smtbmc boolector

[script]
read_verilog -formal -DQTRSTAGE convround.v
read_verilog -formal -DQTRSTAGE qtrstage.v
chparam -set IWIDTH 3 -set OWIDTH 4 qtrstage
prep -top qtrstage

[files]
../../rtl/qtrstage.v
../../rtl/convround.v
